https://okky.kr/articles/953594  
https://okky.kr/articles/1204831  
해당 글을 보고 작성했습니다.

---

최근 JPA를 공부하면서 JPA에 대한 내용을 구글링하다보면 항상 나오는 말이 있다. JPA는 Mybatis에 비해 배우기 어렵다, 러닝커브가 높다.  
사실 맞는말이다. 내 경험상 Mybatis는 OOP를 잘 몰라도 잘 돌아가게 사용할 수 있다. application의 유지보수 및 안정성은 보장 못하지만...ㅋㅋ  
SQL에 모든걸 넣어서 로직을 작성하고 속칭 SuperDTO를 만들어서 그 안에 모든 요소들을 때려박고 SQL의 결과를 받아오는 스타일의 코드도 많이 봐왔다. 저런스타일의 코드를 작성하다 JPA를 다루려니 난이도가 높나? 라는 생각도 들었다.   
<br>
나는 특정 언어나 특정 프레임워크에 종속되있는 개발자가 되긴 싫기에 다른 언어들도 조금씩 찾아봤었다. 그 중 한번씩 찾아보는 언어가 NodeJS인데(프레임워크는 NestJS) NodeJS도 TypeORM이라는 ORM이 있는걸 알았다. NodeJS엔 어떤 라이브러리, 프레임워크가 있는지 정보조차 많이 없지만 TypeORM에대해 찾아봤을때 러닝커브가 높다 라는말을 본적은 없는것같다. 왜그럴까..?  
한국엔 Java개발자가 많아서 많은만큼 배우기 어렵다는 사람이 눈에 많이 띄어서 그럴까?  